In [1]:
import pandas as pd

In [2]:
data = {'apples':[3, 2, 0, 1], 'oranges': [0, 3, 7, 2]}

In [3]:
purchases = pd.DataFrame(data)

In [4]:
print(purchases)

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [5]:
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [6]:
purchases = pd.DataFrame(data, index=['John', 'Ken', 'Peggy', 'Bob'])

purchases

       apples  oranges
John        3        0
Ken         2        3
Peggy       0        7
Bob         1        2

In [7]:
df = pd.read_csv('purchases.csv')
df

  Unnamed: 0  apples  oranges
0       June       3        0
1     Robert       2        3
2       Lily       0        7
3      David       1        2

In [8]:
import sqlite3